# Rebar Crank Overridable Parameters Get Crank End Ratio Formula Params Method

Source: https://www.revitapidocs.com/2026/be774df3-38de-ba6c-cc56-1cc131926d54.htm

---

| Rebar Crank Overridable Parameters Get Crank End Ratio Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with end crank ratio parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankEndRatioFormulaParams()
```

```
Public Function GetCrankEndRatioFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankEndRatioFormulaParams()
```

```
member GetCrankEndRatioFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
Returns the formula parameter ids defined in the RebarShape family which are associated with end crank ratio parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace